MarkSkinner92/arduino-microlab/boards.txt
menu.microlabupload=Upload Method
menu.serverlocation=Server Location

# MicroLab RP2350 (Fixed Configuration)
# -----------------------------------
microlab_rp2350.name=MicroLab
microlab_rp2350.vid.0=0x2e8a
microlab_rp2350.pid.0=0xf00f
microlab_rp2350.build.board=GENERIC_RP2350
microlab_rp2350.build.variant=generic_rp2350
microlab_rp2350.build.core=rp2040
microlab_rp2350.build.ldscript={runtime.platform.path}/custom_memmap.ld

# 1. Architecture & Toolchain (ARM Cortex-M33)
microlab_rp2350.build.chip=rp2350
microlab_rp2350.build.toolchain=arm-none-eabi
microlab_rp2350.build.toolchainpkg=pqt-gcc
microlab_rp2350.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
microlab_rp2350.build.mcu=cortex-m33

# 2. Chip Variant (RP2350A)
microlab_rp2350.build.variantdefines=-D__PICO_RP2350A=1

# 3. Flash & Memory (2MB No FS)
microlab_rp2350.build.flash_total=2097152
microlab_rp2350.build.flash_length=2088960
microlab_rp2350.build.eeprom_start=270524416
microlab_rp2350.build.fs_start=270524416
microlab_rp2350.build.fs_end=270524416

# 4. Clock Speed (50MHz)
microlab_rp2350.build.f_cpu=50000000L

# 5. PSRAM (None)
microlab_rp2350.build.psram_cs=
microlab_rp2350.build.psram_length=0x000000

# 6. Upload Method (Picoprobe/Debugprobe CMSIS-DAP)

# 6. Upload Method Menu

microlab_rp2350.menu.microlabupload.netuploader=Internet
microlab_rp2350.menu.microlabupload.netuploader.build.ram_length=512k
microlab_rp2350.menu.microlabupload.netuploader.build.debugscript=picoprobe.tcl
microlab_rp2350.menu.microlabupload.netuploader.build.picodebugflags=-DENABLE_PICOTOOL_USB
microlab_rp2350.menu.microlabupload.netuploader.upload.maximum_data_size=524288
microlab_rp2350.menu.microlabupload.netuploader.upload.tool=netuploader
microlab_rp2350.menu.microlabupload.netuploader.upload.tool.default=netuploader
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap.build.ram_length=512k
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap.upload.maximum_data_size=524288
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
microlab_rp2350.menu.microlabupload.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# Updated Server Location Menu
microlab_rp2350.menu.serverlocation.localserver=Local Server
# Add a build flag to make the IDE 'see' this as a functional selection
microlab_rp2350.menu.serverlocation.localserver.build.server_loc=-DSERVER_LOCAL
microlab_rp2350.menu.serverlocation.localserver.upload.location=local

microlab_rp2350.menu.serverlocation.onlineserver=Online Server
microlab_rp2350.menu.serverlocation.onlineserver.build.server_loc=-DSERVER_ONLINE
microlab_rp2350.menu.serverlocation.onlineserver.upload.location=online

microlab_rp2350.build.ram_length=512k
microlab_rp2350.build.debugscript=picoprobe_cmsis_dap.tcl

# 7. USB & Defaults
microlab_rp2350.build.usb_manufacturer="MicroLab"
microlab_rp2350.build.usb_product="RP2350"
microlab_rp2350.build.usbvid=-DUSBD_VID=0x2e8a
microlab_rp2350.build.usbpid=-DUSBD_PID=0xf00f
microlab_rp2350.build.boot2=none
microlab_rp2350.build.flags.optimize=-Os
microlab_rp2350.build.flags.rtti=-fno-rtti
microlab_rp2350.build.flags.exceptions=-fno-exceptions
microlab_rp2350.build.flags.libstdcpp=-lstdc++
microlab_rp2350.build.libpicow=liblwip.a
microlab_rp2350.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
microlab_rp2350.build.uf2family=--family rp2350-arm-s --abs-block

# Missing variable stubs to prevent linker errors
microlab_rp2350.build.led=
microlab_rp2350.build.usbpwr=-DUSBD_MAX_POWER_MA=250
microlab_rp2350.build.debug_port=
microlab_rp2350.build.debug_level=
microlab_rp2350.build.usbstack_flags=
microlab_rp2350.build.picodebugflags=
microlab_rp2350.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=109000000
microlab_rp2350.build.os=
microlab_rp2350.build.flags.profile=
microlab_rp2350.build.flags.stackprotect=